Revit 2027 API
PolylineNode.GetPolyline Method
 Returns the polyline object corresponding to the node.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PolyLine GetPolyline()
Public Function GetPolyline As PolyLine
public:
PolyLine^ GetPolyline()
member GetPolyline : unit -> PolyLine
Return Value
PolyLine
 The polyline instance.
See Also
Reference
PolylineNode Class
Autodesk.Revit.DB Namespace